MODEL 2: 

What it does? 

Ranks the top 15 cinemas based on revenue, identifying the highest-grossing cinemas in the dataset. It provides insights into the cinemas that generate the most revenue.


Business question: 
Which cinemas generate the most revenue?


Takeaway: 

Highlights top-performing cinemas, guiding decisions on marketing efforts, resource allocation, or potential expansion opportunities.

In [38]:
import duckdb

In [39]:
conn = duckdb.connect(r'..\cinema_tickets.duckdb')
conn

In [40]:
conn.execute('SHOW TABLES').fetchall()

[('base_model',),
 ('cinema_tickets',),
 ('fifth_model',),
 ('fourth_model',),
 ('master_model',),
 ('second_model',),
 ('seventh_model',),
 ('sixth_model',),
 ('third_model',)]

MODEL 2 QUERY:

In [41]:
query = """
SELECT
    cinema_code,
    CAST(ROUND(SUM(total_revenue_usd), 0) AS INT) AS total_revenue_usd
FROM master_model
GROUP BY cinema_code
ORDER BY total_revenue_usd DESC
LIMIT 16
"""

conn.execute(query).fetch_df()

    cinema_code  total_revenue_usd
0           448          107115351
1           304           50850517
2           163           31426445
3           524           29653153
4           489           29415524
5           344           28661381
6           352           21184878
7           450           20973732
8           518           19939707
9            71           19531621
10          513           18376495
11           89           17411475
12          141           15539299
13          452           14299365
14           72           14036835
15          210           13974950

After creating the table in the duckdb here im just verifying if it runs:

In [42]:
conn.execute('SELECT * FROM second_model').fetchdf()

    cinema_code  total_revenue_usd
0           448          107115351
1           304           50850517
2           163           31426445
3           524           29653153
4           489           29415524
5           344           28661381
6           352           21184878
7           450           20973732
8           518           19939707
9            71           19531621
10          513           18376495
11           89           17411475
12          141           15539299
13          452           14299365
14           72           14036835
15          210           13974950

In [43]:
conn.close()